#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

terraform
data.terraform_remote_state.infra: Reading...
data.terraform_remote_state.infra: Read complete after 0s
data.aws_iam_policy_document.assume_role_node: Reading...
data.aws_iam_policy_document.assume_role_cluster: Reading...
data.aws_iam_policy_document.assume_role_cluster: Read complete after 0s [id=3552664922]
data.aws_iam_policy_document.assume_role_node: Read complete after 0s [id=2851119427]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecr_repository.default will be created
  + resource "aws_ecr_repository" "default" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "fiap-irango-ecr"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = {
          + "Environment" = "studying"
          + "Service"     = "fiap-irango"
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # aws_eks_cluster.default will be created
  + resource "aws_eks_cluster" "default" {
      + arn                   = (known after apply)
      + certificate_authority = (known after apply)
      + cluster_id            = (known after apply)
      + created_at            = (known after apply)
      + endpoint              = (known after apply)
      + id                    = (known after apply)
      + identity              = (known after apply)
      + name                  = "fiap-irango-k8s-cluster"
      + platform_version      = (known after apply)
      + role_arn              = (known after apply)
      + status                = (known after apply)
      + tags                  = {
          + "Name" = "fiap-irango-k8s-cluster"
        }
      + tags_all              = {
          + "Environment" = "studying"
          + "Name"        = "fiap-irango-k8s-cluster"
          + "Service"     = "fiap-irango"
        }
      + version               = (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = false
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = (known after apply)
          + subnet_ids                = [
              + "subnet-0100135833a608e3c",
              + "subnet-06c19418469fe8f7a",
            ]
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.api will be created
  + resource "aws_eks_node_group" "api" {
      + ami_type               = (known after apply)
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "fiap-irango-k8s-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.micro",
        ]
      + node_group_name        = "fiap-irango-k8s-node-group-api"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-0100135833a608e3c",
          + "subnet-06c19418469fe8f7a",
        ]
      + tags                   = {
          + "Name" = "fiap-irango-eks-node-group-api"
        }
      + tags_all               = {
          + "Environment" = "studying"
          + "Name"        = "fiap-irango-eks-node-group-api"
          + "Service"     = "fiap-irango"
        }
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 2
          + max_size     = 3
          + min_size     = 1
        }
    }

  # aws_iam_role.eks_cluster will be created
  + resource "aws_iam_role" "eks_cluster" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "fiap-irango-k8s-cluster"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "studying"
          + "Service"     = "fiap-irango"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role.eks_node will be created
  + resource "aws_iam_role" "eks_node" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "fiap-irango-eks-node"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "studying"
          + "Service"     = "fiap-irango"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.eks_cluster-AmazonEKSClusterPolicy will be created
  + resource "aws_iam_role_policy_attachment" "eks_cluster-AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "fiap-irango-k8s-cluster"
    }

  # aws_iam_role_policy_attachment.eks_cluster-AmazonEKSServicePolicy will be created
  + resource "aws_iam_role_policy_attachment" "eks_cluster-AmazonEKSServicePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy"
      + role       = "fiap-irango-k8s-cluster"
    }

  # aws_iam_role_policy_attachment.eks_cluster-AmazonEKSVPCResourceController will be created
  + resource "aws_iam_role_policy_attachment" "eks_cluster-AmazonEKSVPCResourceController" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "fiap-irango-k8s-cluster"
    }

  # aws_iam_role_policy_attachment.eks_node-AmazonEC2ContainerRegistryReadOnly will be created
  + resource "aws_iam_role_policy_attachment" "eks_node-AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "fiap-irango-eks-node"
    }

  # aws_iam_role_policy_attachment.eks_node-AmazonEKSWorkerNodePolicy will be created
  + resource "aws_iam_role_policy_attachment" "eks_node-AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "fiap-irango-eks-node"
    }

  # aws_iam_role_policy_attachment.eks_node-AmazonEKS_CNI_Policy will be created
  + resource "aws_iam_role_policy_attachment" "eks_node-AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "fiap-irango-eks-node"
    }

  # aws_security_group.eks will be created
  + resource "aws_security_group" "eks" {
      + arn                    = (known after apply)
      + description            = "inbound: HTTP + outbound: none"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTPS"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTPS"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "fiap-irango-security-group-eks"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "fiap-irango-security-group-eks"
        }
      + tags_all               = {
          + "Environment" = "studying"
          + "Name"        = "fiap-irango-security-group-eks"
          + "Service"     = "fiap-irango"
        }
      + vpc_id                 = "vpc-0f57070f63664a169"
    }

Plan: 12 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws_eks_cluster_endpoint              = (known after apply)
  + kubeconfig-certificate-authority-data = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>